<script setup>
import WelcomeItem from './WelcomeItem.vue'
import DocumentationIcon from './icons/IconDocumentation.vue'
import ToolingIcon from './icons/IconTooling.vue'
</script>

<template>
  <WelcomeItem>
    <template #icon>
      <DocumentationIcon />
    </template>
    <template #heading>Создание компонента "Список заказов":</template>

    <b>Функциональность</b>: <br>
    - Отображение списка производственных заказов с деталями (номер заказа, название продукта, дата начала, статус).
    <br>
    - Возможность фильтрации заказов по статусу (все, в процессе, завершённые). <br>
    - Реализация функции поиска по номеру заказа или названию продукта. <br>

    <br>
    <b>Требования</b>: <br>
    - Данные должны загружаться с API или использовать моки.
    - Интерфейс должен быть адаптивным и удобным для использования на разных устройствах.
    - Код должен быть структурирован и разбит на отдельные компоненты.
  </WelcomeItem>

  <WelcomeItem>
    <template #icon>
      <ToolingIcon />
    </template>
    <template #heading>Создание компонента "Детали заказа":</template>

    <b>Функциональность</b>:
    - Отображение детальной информации о заказе при его выборе из списка. <br>
    - Возможность редактирования деталей заказа (наименование, количество, дата начала, статус). <br>
    <br>
    <b>Требования</b>: <br>
    - Данные должны загружаться с API при загрузке компонента или использовать моки. <br>
    - Реализовать двухстороннюю привязку данных для редактирования формы. <br>
    - Валидация данных формы перед отправкой на сервер.
  </WelcomeItem>
</template>
